Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.bucket.google_storage_bucket.bucket: Refreshing state... [id=new-bucket-example-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # module.apigee-integration.google_storage_bucket.bucket will be created
+ resource "google_storage_bucket" "bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-EAST1"
      + name                        = "apigee-integration-dev"
      + project                     = "unifique-5g"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "Standard"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # module.app-cdr.google_storage_bucket.bucket will be created
+ resource "google_storage_bucket" "bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-EAST1"
      + name                        = "aplication-cdr-oss-dev"
      + project                     = "unifique-5g"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "standard"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # module.bucket.google_storage_bucket.bucket will be destroyed
  # (because google_storage_bucket.bucket is not in configuration)
- resource "google_storage_bucket" "bucket" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {} -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "new-bucket-example-2" -> null
      - labels                      = {} -> null
      - location                    = "US-EAST1" -> null
      - name                        = "new-bucket-example-2" -> null
      - project                     = "unifique-5g" -> null
      - project_number              = 740147432362 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/new-bucket-example-2" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {} -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://new-bucket-example-2" -> null

      - soft_delete_policy {
          - effective_time             = "2024-05-14T18:51:50.571Z" -> null
          - retention_duration_seconds = 604800 -> null
        }
    }

  # module.lets-encrypt.google_storage_bucket.bucket will be created
+ resource "google_storage_bucket" "bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-EAST1"
      + name                        = "lets-encrypt-certification-dev"
      + project                     = "unifique-5g"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "standard"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # module.terraform-state-dev.google_storage_bucket.bucket will be created
+ resource "google_storage_bucket" "bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-EAST1"
      + name                        = "terraform-state-dev"
      + project                     = "unifique-5g"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "standard"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

Plan: 4 to add, 0 to change, 1 to destroy.
Releasing state lock. This may take a few moments...
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://652b-189-45-192-4.ngrok-free.app/lock?id=magsti%252Fmodule-child-bucket-gcp%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 4 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`